#+TITLE: C++20
#+AUTHOR: Dr. Günter Kolousek
#+DATE: \copy Dr. Günter Kolousek \hspace{12ex} [[http://creativecommons.org/licenses/by-nc-nd/4.0/][Creative Commons Namensnennung - Nicht kommerziell - Keine Bearbeitungen 4.0 International Lizenz]]

#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]u
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX_HEADER: \newcommand{\imp}{\ensuremath{\rightarrow}\xspace}

* lambda mit Template-Parameter
\vspace{1.5em}
\small
#+header: :exports code :tangle src/lambda_template_parameter.cpp
#+begin_src C++
#include <iostream>  // lambda_template_parameter.cpp
using namespace std;
int main() {
    // arbitrary types but must be identical
    auto f = []<typename T>(T x, T y){
        return x + y;
    };
    cout << f(1, 2) << ' ';
    cout << f(3.5, 2.5) << ' ';
    // cout << f(3.5, 2) << ' '; //no match for call...
    cout << f(string{"a"}, string{"bc"}) << endl;
}
#+end_src

#+RESULTS:
: 3 6 abc

